; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	image1 - mode
	thermograph2 - mode
	thermograph0 - mode
	Star1 - direction
	GroundStation2 - direction
	Star4 - direction
	Star5 - direction
	Star6 - direction
	Star7 - direction
	GroundStation8 - direction
	GroundStation9 - direction
	Star3 - direction
	GroundStation0 - direction
	Planet10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 thermograph2)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
)
(:goal (and
	(pointing satellite0 Star7)
	(have_image Planet10 thermograph2)
	(have_image Planet11 thermograph0)
	(have_image Phenomenon12 thermograph2)
	(have_image Star13 image1)
	(have_image Star14 image1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
2. (turn_to satellite0 phenomenon12 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 phenomenon12)
   goals met: 0 of 6
3. (turn_to satellite0 star3 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star3)
   goals met: 0 of 6
4. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 0 of 6
5. (turn_to satellite0 phenomenon12 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon12)
   goals met: 0 of 6
6. (take_image satellite0 phenomenon12 instrument0 thermograph2)
   added: (have_image phenomenon12 thermograph2)
   goals met: 1 of 6
7. (turn_to satellite0 planet10 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 planet10)
   goals met: 1 of 6
8. (take_image satellite0 planet10 instrument0 thermograph2)
   added: (have_image planet10 thermograph2)
   goals met: 2 of 6
9. (turn_to satellite0 planet11 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet11)
   goals met: 2 of 6
10. (take_image satellite0 planet11 instrument0 thermograph0)
   added: (have_image planet11 thermograph0)
   goals met: 3 of 6
11. (turn_to satellite0 star13 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 star13)
   goals met: 3 of 6
12. (take_image satellite0 star13 instrument0 image1)
   added: (have_image star13 image1)
   goals met: 4 of 6
13. (turn_to satellite0 star14 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star14)
   goals met: 4 of 6
14. (take_image satellite0 star14 instrument0 image1)
   added: (have_image star14 image1)
   goals met: 5 of 6
15. (turn_to satellite0 star7 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star7)
   goals met: 6 of 6
